//====================================================================================================================
//====================================================================================================================
// src/middlewares/errorHandling.middleware.js
// 에러 처리 미들웨어 - try~ catch문 적용으로 서버 internal error 처리
//====================================================================================================================
//====================================================================================================================
export default function (err, req, res, next) {
    console.error(err);
    loggers.error({
        message: '[Error] ehm found error',
        error: err.message,
        stack: err.stack,
    });
    res.status(500).json({ errorMessage: '[Error] Server internal error.' });
}